Autodesk.Revit.DB.MEPAnalyticalConnection.CreateMultipleConnections(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Connector},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Creates new analytical connections between the equipment connector and the nearest point on the curves.
doc:
The document where the new elements are created.
typeId:
The type of new analytical connections.
equipmentOpenConnectors:
The open equipment connectors to be analytically connected.
curveIdsToConnect:
The curves which the equipment is connected to.
Returns:
The new analytical connection elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid connection type.
-or-
Not all connectors support the analytical connection.
-or-
No connector included.
-or-
Not all elements are valid curve ids.
-or-
No curve included.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnection.CanSupportAnalyticalConnection(Autodesk.Revit.DB.Connector)
Checks if the connector can support the analytical connection.
connector:
The testing connector.
Returns:
True if the connector can support the network flow/pressure analysis, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnection.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Creates a new analytical connection between two open connectors.
doc:
The document where the new element is created.
typeId:
The type of new analytical connection.
startConnector:
The open connector on the equipment side, whose level is inherited by the analytical connection.
endConnector:
The open connector on the network.
Returns:
The newly created analytical connection element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid connection type.
-or-
The connector does not support analytical connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018